namespace SolveITMail.Models
{
    /********************************************************************\
    ИНТЕРФЕЙС.: ISendDataReader
    ОПИСАНИЕ..: Читает данные об отправлениях определённого пользователя.
    МЕТОДЫ....: Write(CUser user, CSendData data) - записывает данные о
                новой посылке пользователя.
    \********************************************************************/
    public interface ISendDataWriter
    {
        /********************************************************************\
        МЕТОД.....: Write
        ОПИСАНИЕ..: Записывает данные о новой посылке
        ПАРАМЕТРЫ.: CUser user - данные отправителя
                    CSendData data - информация об отправлении
        \********************************************************************/
        void Write(CUser user, CSendData data);
    }
}
