using System.Collections.Generic;

namespace SolveITMail.Models
{
    /********************************************************************\
    ИНТЕРФЕЙС.: ISendDataReader
    ОПИСАНИЕ..: Читает данные об отправлениях определённого пользователя.
    МЕТОДЫ....: List<CSendData> Read(CUser user) - считывает данные о
                находящихся в пути посылках пользователя.
    \********************************************************************/
    public interface ISendDataReader
    {
        /********************************************************************\
        МЕТОД.....: Read
        ОПИСАНИЕ..: Считывает данные о находящихся в пути посылках пользователя
        ПАРАМЕТРЫ.: CUser user - данные пользователя
        ВОЗВРАЩАЕТ: List<CSendData> - данные о посылках, находящихся в пути
        \********************************************************************/
        List<CSendData> Read(CUser user);
    }
}
