namespace SolveITMail.Models
{
    /********************************************************************\
    ИНТЕРФЕЙС.: IAuthenticator
    ОПИСАНИЕ..: Интерфейс классов, проводящих аутентификацию пользователя
    МЕТОДЫ....: CUser Find(CAuthorizationData data) - поиск данных о
                пользователе по заданному логину и паролю
                bool Handshake() - проверка доступа к месту хранения
                данных о пользователях
    \********************************************************************/
    public interface IAuthenticator
    {
        /********************************************************************\
        МЕТОД.....: Find
        ОПИСАНИЕ..: Возвращает данные о пользователе по информации для входа
        ПАРАМЕТРЫ.: CAuthorizationData data - данные для входа
        ВОЗВРАЩАЕТ: CUser - данные о пользователе
        ПРИМЕЧАНИЕ: Если в системе не зарегистрирован пользователь с
                    указанным логином и паролем, то возвращается null
        \********************************************************************/
        CUser Find(CAuthorizationData data);

        /********************************************************************\
        МЕТОД.....: Handshake
        ОПИСАНИЕ..: Проверка доступа к месту хранения данных о пользователях
        ВОЗВРАЩАЕТ: bool - есть ли доступ
        \********************************************************************/
        bool Handshake();
    }
}
